[
  "txt-as-md-obsidian",
  "table-editor-obsidian",
  "calendar",
  "obsidian-citation-plugin",
  "obsidian-code-copy",
  "customizable-menu",
  "dataview",
  "obsidian-excalidraw-plugin",
  "obsidian-fullscreen-plugin",
  "obsidian-kanban",
  "obsidian-local-images",
  "markdown-prettifier",
  "obsidian-git",
  "obsidian-to-anki-plugin",
  "oz-image-plugin",
  "obsidian-pandoc",
  "pdf-to-markdown-plugin",
  "periodic-notes",
  "templater-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-extract-pdf-highlights",
  "extract-url",
  "code-block-copy",
  "url-into-selection"
]